# Задание № 1
a = int(input('Введите одно целое число')) # запрос на ввод 1-го  целого числа
b = int(input('Введите второе целое число')) # запрос на ввод 2-го  целого числа
c = str(input('Введите строку')) # запрос на ввод строки
d = float(input('Введите дробное число')) # запрос на ввод дробного числа
print() # пустая строка между запросом и выводом информации на экран
print(c, a, b, d) # вывод на экран строки, 2 целых числа, дробного числа

# Задание № 2
a = 5 # присвоили переменной 'а' значение 5 (целое число)
pi = 3.14 # присвоили переменной 'pi' значение 3.14 (число с плавающей запятой)
t = True # присвоили переменной 't' значение True (булевая константа)
s = 'Hello, word' # присвоили переменной 's' значение 'Hello, word' (строка)

a1 = str(a) # преобразование числового значения переменной 'а' в строку
pi1 = str(pi) # преобразование числового значения с плавающей запятой переменной 'pi' в строку

# Задание № 3
name = input('Напишите Ваше имя') # запрос на ввод имени
surname = input('Напишите Вашу Фамилию') # запрос на ввод фамилии
patronymic = input('Напишите Ваше отчество') # запрос на ввод отчетва
age = input('Сколько Вам лет?') # запрос на ввод возраста
citi = input('В каком городе Вы живете?') # запрос на ввод города проживания
print() # пустая строка между запросом и выводом информации на экран
print(surname, name, patronymic) # вывод на экран ФИО
print(age, citi) # вывод на экран возраста и города проживания

# Задание № 3
name = input('Напишите Ваше имя') # запрос на ввод имени
surname = input('Напишите Вашу Фамилию') # запрос на ввод фамилии
patronymic = input('Напишите Ваше отчество') # запрос на ввод отчетва
age = input('Сколько Вам лет?') # запрос на ввод возраста
citi = input('В каком городе Вы живете?') # запрос на ввод города проживания
print() # пустая строка между запросом и выводом информации на экран
print(surname, name, patronymic) # вывод на экран ФИО
print(age, citi) # вывод на экран возраста и города проживания




